<h1>Performing Multi-Table Inserts</h1>

<h3>Introduction</h3>

<strong>Multi-table inserts allow you to insert data into multiple tables in a single SQL statement. 
<br>This can be useful for maintaining data integrity and reducing the number of separate insert operations required when related data is being added to multiple tables. 
<br>However, the exact syntax and capabilities can vary between database systems.</strong>

<h3>Key Concepts</h3>

<strong>Referential Integrity: </strong>Ensure that foreign keys in the child tables refer to valid records in the parent tables.
<br><strong>Transaction Control: </strong>It's important to use transactions when performing multi-table inserts to maintain data consistency and integrity.

<h3>Syntax for Multi-Table Inserts</h3>

<strong>Multi-table inserts can be done in several ways depending on the database system being used. Here are common methods:</strong>

<strong>Using INSERT ... SELECT for Related Tables</strong>
This method allows you to insert records into one table based on the results of a SELECT statement from another table.
    
    INSERT INTO employees (first_name, last_name, department_id)
    SELECT 'John', 'Doe', department_id FROM departments WHERE department_name = 'Sales';
    
<strong>Using INSERT ALL Statement</strong>
In Oracle, you can use the INSERT ALL statement to insert data into multiple tables at once.
    
    INSERT ALL
      INTO employees (first_name, last_name, department_id) VALUES ('Alice', 'Smith', 10)
      INTO contractors (first_name, last_name, contract_id) VALUES ('Bob', 'Jones', 20)
    SELECT * FROM dual;

<strong>Using INSERT INTO ... VALUES for Multiple Rows</strong>
You can also insert multiple rows into a single table at once. This method is typically used when inserting into one table only.

    INSERT INTO employees (first_name, last_name, department_id) 
    VALUES ('Alice', 'Smith', 10), 
           ('Bob', 'Jones', 20);

<strong>Practical Use Cases:</strong>

    Multi-table inserts can streamline data entry processes, especially when dealing with related datasets. 
    
    For example, when onboarding new employees, you may want to insert records into both the employees table and a salary table in one go.

<strong>Best Practices:</strong>

    Maintain Referential Integrity: Ensure that inserts into related tables respect foreign key constraints.

    se Transactions: Always wrap multi-table inserts in a transaction to maintain data integrity in case of errors.

    Test and Validate: Thoroughly test multi-table insert operations to ensure they perform as expected without data loss.